Lecture3/cylinder3D_coded/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

ny 40;
nx_before 40;
nx_after 100;
nz 40;

vertices
(

   #include "vertices"

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx_before $ny $nz) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (10 $ny $nz) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (10 $ny $nz) simpleGrading (1 1 1)
    hex (12 16 17 13 14 18 19 15) ($nx_after $ny $nz) simpleGrading (1 1 1)


    hex (20 21 1 0 22 23 5 4) ($nx_before $ny $nz) simpleGrading (1 1 1)
    hex (21 24 25 1 23 26 27 5 ) (10 $ny $nz) simpleGrading (1 1 1)
    hex (24 28 12 25 26 30 14 27) (10 $ny $nz) simpleGrading (1 1 1)
    hex (28 29 16 12 30 31 18 14) ($nx_after $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (7 3 0 4)
            (4 0 20 22)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (17 19 18 16)
            (16 18 31 29)
        );
    }

    square
    {
        type patch;
        faces
        (
            (8 10 5 1)
            (12 14 10 8)
            (1 5 27 25)
            (14 12 25 27)
        );
    }

    sides
    {
        type patch;
        faces
        (
            //top side
            (6 2 3 7)
            (11 9 2 6)
            (15 13 9 11)
            (19 17 13 15)

            //bottom side
            (22 20 21 23)
            (23 21 24 26)
            (26 24 28 30)
            (30 28 29 31)

            //front
            (7 4 5 6)
            (6 5 10 11)
            (11 10 14 15)
            (15 14 18 19)
            (4 22 23 5)
            (27 5 23 26)
            (14 27 26 30)
            (18 14 30 31)

            //back
            (0 3 2 1)
            (1 2 9 8)
            (12 8 9 13)
            (16 12 13 17)
            (21 20 0 1)
            (24 21 1 25)
            (28 24 25 12)
            (29 28 12 16)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
