Lecture3/cylinder3D_coded/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          3200;
        startFace       1512800;
    }
    outlet
    {
        type            patch;
        nFaces          3200;
        startFace       1516000;
    }
    square
    {
        type            patch;
        nFaces          1600;
        startFace       1519200;
    }
    sides
    {
        type            patch;
        nFaces          38400;
        startFace       1520800;
    }
)

// ************************************************************************* //
