Lecture3/cylinder3D_coded/system/vertices
( 0.0 0.0 -1.5) //P0 
( 5.0 0.0 -1.5) //P1 
( 5.0 5.0 -1.5) //P2 
( 0.0 5.0 -1.5) //P3 
( 0.0 0.0 1.5) //P4 
( 5.0 0.0 1.5) //P5 
( 5.0 5.0 1.5) //P6 
( 0.0 5.0 1.5) //P7 
( 6.0 1.0 -1.5) //P8 
( 6.0 5.0 -1.5) //P9 
( 6.0 1.0 1.5) //P10 
( 6.0 5.0 1.5) //P11 
( 7.0 0.0 -1.5) //P12 
( 7.0 5.0 -1.5) //P13 
( 7.0 0.0 1.5) //P14 
( 7.0 5.0 1.5) //P15 
( 20.0 0.0 -1.5) //P16 
( 20.0 5.0 -1.5) //P17 
( 20.0 0.0 1.5) //P18 
( 20.0 5.0 1.5) //P19 
( 0.0 -5.0 -1.5) //P20 
( 5.0 -5.0 -1.5) //P21 
( 0.0 -5.0 1.5) //P22 
( 5.0 -5.0 1.5) //P23 
( 6.0 -5.0 -1.5) //P24 
( 6.0 -1.0 -1.5) //P25 
( 6.0 -5.0 1.5) //P26 
( 6.0 -1.0 1.5) //P27 
( 7.0 -5.0 -1.5) //P28 
( 20.0 -5.0 -1.5) //P29 
( 7.0 -5.0 1.5) //P30 
( 20.0 -5.0 1.5) //P31 
